{"pageProps":{"chain":{"name":"zkSync Mainnet","chain":"ETH","rpc":[{"url":"https://zksync-era.blockpi.network/v1/rpc/public","tracking":"limited","trackingDetails":"We do not collect request data or request origin. We only temporarily record the request method names and IP addresses for 7 days to ensure our service functionality such as load balancing and DDoS protection. All the data is automatically deleted after 7 days and we do not store any user information for longer periods of time. https://blockpi.io/privacy-policy"},{"url":"https://zksync.meowrpc.com","tracking":"none","trackingDetails":"With the exclusion of data that will be openly visible and available on the blockchain, MEOWRPC does not track or store any kind of user information (such as location, IP address, etc.) that passes through our RPC. For further details regarding our privacy practices, we encourage you to refer to our Privacy Policy. https://privacy.meowrpc.com"},{"url":"https://zksync.drpc.org","tracking":"none","trackingDetails":"Specific types of technical data that we may temporarily log include:IP address (only in logs for redirecting requests to the nearest RPC nodes and rate limiting at the free level, which are cleared weekly). The user ID is hidden in the temporary logs, so it is not possible to link them to a specific user.https://drpc.org/privacy-policy"},{"url":"https://1rpc.io/zksync2-era","tracking":"none","trackingDetails":"With the exception of data that will be public on chain, all the other metadata / data should remain private to users and other parties should not be able to access or collect it. 1RPC uses many different techniques to prevent the unnecessary collection of user privacy, which prevents tracking from RPC providers. https://docs.1rpc.io/technology/zero-tracking"},{"url":"https://mainnet.era.zksync.io"}],"faucets":[],"nativeCurrency":{"name":"Ether","symbol":"ETH","decimals":18},"infoURL":"https://zksync.io/","shortName":"zksync","chainId":324,"networkId":324,"icon":"zksync-era","explorers":[{"name":"zkSync Era Block Explorer","url":"https://explorer.zksync.io","icon":"zksync-era","standard":"EIP3091"}],"parent":{"type":"L2","chain":"eip155-1","bridges":[{"url":"https://bridge.zksync.io/"}]}}},"__N_SSG":true}