{"pageProps":{"chain":{"name":"Base","chain":"ETH","rpc":[{"url":"https://base.llamarpc.com","tracking":"none","trackingDetails":"LlamaNodes is open-source and does not track or store user information that transits through our RPCs (location, IP, wallet, etc). To learn more, have a look at the public Privacy Policy in our docs: https://llamanodes.notion.site/Privacy-Practices-f20fd8fdd02a469d9d4f42a5989bb936","isOpenSource":true},{"url":"https://mainnet.base.org"},{"url":"https://developer-access-mainnet.base.org"},{"url":"https://base-mainnet.diamondswap.org/rpc","tracking":"limited","trackingDetails":"We record limited metadata from requests. This data is stored for a maximum of 90 days and is solely used for debugging, identifying suspicious activity, and generating analytics."},{"url":"https://base.blockpi.network/v1/rpc/public","tracking":"limited","trackingDetails":"We do not collect request data or request origin. We only temporarily record the request method names and IP addresses for 7 days to ensure our service functionality such as load balancing and DDoS protection. All the data is automatically deleted after 7 days and we do not store any user information for longer periods of time. https://blockpi.io/privacy-policy"},{"url":"https://1rpc.io/base","tracking":"none","trackingDetails":"With the exception of data that will be public on chain, all the other metadata / data should remain private to users and other parties should not be able to access or collect it. 1RPC uses many different techniques to prevent the unnecessary collection of user privacy, which prevents tracking from RPC providers. https://docs.1rpc.io/technology/zero-tracking"},{"url":"https://base-pokt.nodies.app","tracking":"none","trackingDetails":"What We Do Not Collect: User's IP address, request origin, request data. https://www.blog.pokt.network/rpc-logging-practices/"},{"url":"https://base.meowrpc.com","tracking":"none","trackingDetails":"With the exclusion of data that will be openly visible and available on the blockchain, MEOWRPC does not track or store any kind of user information (such as location, IP address, etc.) that passes through our RPC. For further details regarding our privacy practices, we encourage you to refer to our Privacy Policy. https://privacy.meowrpc.com"},{"url":"https://base-mainnet.public.blastapi.io","tracking":"limited","trackingDetails":"All the information in our logs (log data) can only be accessed for the last 7 days at any certain time, and it is completely purged after 14 days. We do not store any user information for longer periods of time or with any other purposes than investigating potential errors and service failures. https://blastapi.io/privacy-policy"},{"url":"https://base.gateway.tenderly.co","tracking":"yes","trackingDetails":"Additionally, if you are an Account Member, we may collect business and transactional data about you (and your business) that accumulates over the normal course of operation regarding providing our Services. This may include transaction records, stored files, user profiles, information about collaborators, analytics data, and other metrics, as well as other types of information created or generated by your interaction with our Services. https://tenderly.co/privacy-policy"},{"url":"https://gateway.tenderly.co/public/base","tracking":"yes","trackingDetails":"Additionally, if you are an Account Member, we may collect business and transactional data about you (and your business) that accumulates over the normal course of operation regarding providing our Services. This may include transaction records, stored files, user profiles, information about collaborators, analytics data, and other metrics, as well as other types of information created or generated by your interaction with our Services. https://tenderly.co/privacy-policy"},{"url":"https://rpc.notadegen.com/base"},{"url":"https://base-rpc.publicnode.com","tracking":"none","trackingDetails":"We do not store or track any user data with the exception of data that will be public on chain. We do not correlate wallets address's with IP's,  any data which is needed to transact is deleted after 24 hours. We also do no use any Analytics or 3rd party website tracking. https://www.publicnode.com/privacy"},{"url":"wss://base-rpc.publicnode.com","tracking":"none","trackingDetails":"We do not store or track any user data with the exception of data that will be public on chain. We do not correlate wallets address's with IP's,  any data which is needed to transact is deleted after 24 hours. We also do no use any Analytics or 3rd party website tracking. https://www.publicnode.com/privacy"},{"url":"https://base.drpc.org","tracking":"none","trackingDetails":"Specific types of technical data that we may temporarily log include:IP address (only in logs for redirecting requests to the nearest RPC nodes and rate limiting at the free level, which are cleared weekly). The user ID is hidden in the temporary logs, so it is not possible to link them to a specific user.https://drpc.org/privacy-policy"},{"url":"https://endpoints.omniatech.io/v1/base/mainnet/public","tracking":"none","trackingDetails":"All the data and metadata remain private to the users. No third party is able to access, analyze or track it. OMNIA leverages different technologies and approaches to guarantee the privacy of their users, from front-running protection and private mempools, to obfuscation and random dispatching. https://blog.omniatech.io/how-omnia-handles-your-personal-data"},{"url":"https://base.api.onfinality.io/public","tracking":"limited","trackingDetails":"For the sole purpose of providing our service, we temporarily record IP addresses and origins to check against free limits, provide load balancing, prevent DOS attacks, and to determine where best to locate our nodes. We do not, and will never, correlate or link specific wallet addresses or transactions made over our infrastructure to the IP address or origin making the RPC request. After processing IP addresses, we discard the IP address value within 24 hours. Read more here: https://blog.onfinality.io/how-does-onfinality-deal-with-personal-information/"},{"url":"https://public.stackup.sh/api/v1/node/base-mainnet","tracking":"limited","trackingDetails":"We collect Personal Data about you from the following categories of sources: You, When you provide such information directly to us, When you create an account or use our interactive tools and Services. When you use the Services and such information is collected automatically, Third Parties. Read more at https://www.stackup.sh/privacy"},{"url":"wss://base.gateway.tenderly.co"}],"faucets":[],"nativeCurrency":{"name":"Ether","symbol":"ETH","decimals":18},"infoURL":"https://base.org","shortName":"base","chainId":8453,"networkId":8453,"icon":"base","explorers":[{"name":"basescan","url":"https://basescan.org","standard":"none"},{"name":"basescout","url":"https://base.blockscout.com","icon":"blockscout","standard":"EIP3091"},{"name":"dexguru","url":"https://base.dex.guru","icon":"dexguru","standard":"EIP3091"}],"status":"active","tvl":722684275.7995847,"chainSlug":"base"}},"__N_SSG":true}