{"pageProps":{"chain":{"name":"OKXChain Mainnet","chain":"okxchain","rpc":[{"url":"https://exchainrpc.okex.org"},{"url":"https://oktc-mainnet.public.blastapi.io","tracking":"limited","trackingDetails":"All the information in our logs (log data) can only be accessed for the last 7 days at any certain time, and it is completely purged after 14 days. We do not store any user information for longer periods of time or with any other purposes than investigating potential errors and service failures. https://blastapi.io/privacy-policy"},{"url":"https://okt-chain.api.onfinality.io/public","tracking":"limited","trackingDetails":"For the sole purpose of providing our service, we temporarily record IP addresses and origins to check against free limits, provide load balancing, prevent DOS attacks, and to determine where best to locate our nodes. We do not, and will never, correlate or link specific wallet addresses or transactions made over our infrastructure to the IP address or origin making the RPC request. After processing IP addresses, we discard the IP address value within 24 hours. Read more here: https://blog.onfinality.io/how-does-onfinality-deal-with-personal-information/"},{"url":"https://1rpc.io/oktc","tracking":"none","trackingDetails":"With the exception of data that will be public on chain, all the other metadata / data should remain private to users and other parties should not be able to access or collect it. 1RPC uses many different techniques to prevent the unnecessary collection of user privacy, which prevents tracking from RPC providers. https://docs.1rpc.io/technology/zero-tracking"},{"url":"https://okc-mainnet.gateway.pokt.network/v1/lb/6275309bea1b320039c893ff"}],"faucets":[],"nativeCurrency":{"name":"OKXChain Global Utility Token","symbol":"OKT","decimals":18},"infoURL":"https://www.okex.com/okc","shortName":"okt","chainId":66,"networkId":66,"explorers":[{"name":"OKLink","url":"https://www.oklink.com/en/okc","standard":"EIP3091"}],"tvl":32225460.66373611,"chainSlug":"okexchain"}},"__N_SSG":true}