{"pageProps":{"chain":{"name":"Scroll","chain":"ETH","status":"active","rpc":[{"url":"https://rpc.scroll.io"},{"url":"https://rpc-scroll.icecreamswap.com"},{"url":"https://scroll-mainnet.public.blastapi.io","tracking":"limited","trackingDetails":"All the information in our logs (log data) can only be accessed for the last 7 days at any certain time, and it is completely purged after 14 days. We do not store any user information for longer periods of time or with any other purposes than investigating potential errors and service failures. https://blastapi.io/privacy-policy"},{"url":"https://scroll-mainnet-public.unifra.io","tracking":"limited","trackingDetails":"Regarding the RPC(remote procedure call) data, we do not collect request data or request origin. We temporarily record the request method names and IP addresses for 7 days to ensure our service functionality such as load balancing and DDoS protection. All the data is automatically deleted after 7 days. Only the amounts of RPC requests of users are recorded for accounting and billing purposes within longer time. https://unifra.io/"},{"url":"https://scroll.blockpi.network/v1/rpc/public","tracking":"limited","trackingDetails":"We do not collect request data or request origin. We only temporarily record the request method names and IP addresses for 7 days to ensure our service functionality such as load balancing and DDoS protection. All the data is automatically deleted after 7 days and we do not store any user information for longer periods of time. https://blockpi.io/privacy-policy"},{"url":"https://1rpc.io/scroll","tracking":"none","trackingDetails":"With the exception of data that will be public on chain, all the other metadata / data should remain private to users and other parties should not be able to access or collect it. 1RPC uses many different techniques to prevent the unnecessary collection of user privacy, which prevents tracking from RPC providers. https://docs.1rpc.io/technology/zero-tracking"},{"url":"https://scroll.drpc.org","tracking":"none","trackingDetails":"Specific types of technical data that we may temporarily log include:IP address (only in logs for redirecting requests to the nearest RPC nodes and rate limiting at the free level, which are cleared weekly). The user ID is hidden in the temporary logs, so it is not possible to link them to a specific user.https://drpc.org/privacy-policy"},{"url":"https://scroll-mainnet.rpc.grove.city/v1/a7a7c8e2","tracking":"none","trackingDetails":"What We Do Not Collect: User's IP address, request origin, request data. https://www.blog.pokt.network/rpc-logging-practices/"},{"url":"https://rpc.ankr.com/scroll"},{"url":"https://scroll-mainnet.chainstacklabs.com"}],"faucets":[],"nativeCurrency":{"name":"Ether","symbol":"ETH","decimals":18},"infoURL":"https://scroll.io","shortName":"scr","chainId":534352,"networkId":534352,"explorers":[{"name":"Scrollscan","url":"https://scrollscan.com","standard":"EIP3091"},{"name":"Blockscout","url":"https://blockscout.scroll.io","standard":"EIP3091"}],"parent":{"type":"L2","chain":"eip155-1","bridges":[{"url":"https://scroll.io/bridge"}]}}},"__N_SSG":true}