{"pageProps":{"chain":{"name":"Fuse Mainnet","chain":"FUSE","rpc":[{"url":"https://rpc.fuse.io"},{"url":"https://fuse-pokt.nodies.app","tracking":"none","trackingDetails":"What We Do Not Collect: User's IP address, request origin, request data. https://www.blog.pokt.network/rpc-logging-practices/"},{"url":"https://fuse-mainnet.chainstacklabs.com","tracking":"yes","trackingDetails":"We process certain personal data to provide you with the core functionality of our Services. Specifically, when you are: Using the Chainstack Console, we process your name, surname, email address (your account identifier), organization name, IP address, all HTTP headers (most importantly User-Agent), cookies; Using the Chainstack Blockchain infrastructure, we process nodes' token stored in Chainstack Vault, IP address and HTTP headers, request body, API token in Chainstack Vault.https://chainstack.com/privacy/"},{"url":"https://fuse.api.onfinality.io/public","tracking":"limited","trackingDetails":"For the sole purpose of providing our service, we temporarily record IP addresses and origins to check against free limits, provide load balancing, prevent DOS attacks, and to determine where best to locate our nodes. We do not, and will never, correlate or link specific wallet addresses or transactions made over our infrastructure to the IP address or origin making the RPC request. After processing IP addresses, we discard the IP address value within 24 hours. Read more here: https://blog.onfinality.io/how-does-onfinality-deal-with-personal-information/"},{"url":"https://fuse.liquify.com","tracking":"yes","trackingDetails":"What data do we collect? Information collected automatically from your device, including IP address, device type,operating system, browser-type, broad geographic location and other technical information.https://www.liquify.io/privacy_policy.pdf"}],"faucets":[],"nativeCurrency":{"name":"Fuse","symbol":"FUSE","decimals":18},"infoURL":"https://fuse.io/","shortName":"fuse","chainId":122,"networkId":122,"icon":"fuse","explorers":[{"name":"blockscout","url":"https://explorer.fuse.io","icon":"blockscout","standard":"EIP3091"}],"tvl":3019661.0897330837,"chainSlug":"fuse"}},"__N_SSG":true}