{"pageProps":{"chain":{"name":"Fantom Testnet","chain":"FTM","rpc":[{"url":"https://rpc.testnet.fantom.network"},{"url":"https://endpoints.omniatech.io/v1/fantom/testnet/public","tracking":"none","trackingDetails":"All the data and metadata remain private to the users. No third party is able to access, analyze or track it. OMNIA leverages different technologies and approaches to guarantee the privacy of their users, from front-running protection and private mempools, to obfuscation and random dispatching. https://blog.omniatech.io/how-omnia-handles-your-personal-data"},{"url":"https://rpc.ankr.com/fantom_testnet","tracking":"limited","trackingDetails":"For service delivery purposes, we temporarily record IP addresses to set usage limits and monitor for denial of service attacks against our infrastructure. Though we do look at high-level data around the success rate of transactions made over the blockchain RPC, we do not correlate wallet transactions made over the infrastructure to the IP address making the RPC request. Thus, we do not store, exploit, or share any information regarding Personal Identifiable Information (PII), including wallet addresses. https://www.ankr.com/blog/ankrs-ip-address-policy-and-your-privacy/"},{"url":"https://fantom-testnet.public.blastapi.io","tracking":"limited","trackingDetails":"All the information in our logs (log data) can only be accessed for the last 7 days at any certain time, and it is completely purged after 14 days. We do not store any user information for longer periods of time or with any other purposes than investigating potential errors and service failures. https://blastapi.io/privacy-policy"},{"url":"https://fantom-testnet-rpc.publicnode.com","tracking":"none","trackingDetails":"We do not store or track any user data with the exception of data that will be public on chain. We do not correlate wallets address's with IP's,  any data which is needed to transact is deleted after 24 hours. We also do no use any Analytics or 3rd party website tracking. https://www.publicnode.com/privacy"},{"url":"wss://fantom-testnet-rpc.publicnode.com","tracking":"none","trackingDetails":"We do not store or track any user data with the exception of data that will be public on chain. We do not correlate wallets address's with IP's,  any data which is needed to transact is deleted after 24 hours. We also do no use any Analytics or 3rd party website tracking. https://www.publicnode.com/privacy"},{"url":"https://fantom.api.onfinality.io/public","tracking":"limited","trackingDetails":"For the sole purpose of providing our service, we temporarily record IP addresses and origins to check against free limits, provide load balancing, prevent DOS attacks, and to determine where best to locate our nodes. We do not, and will never, correlate or link specific wallet addresses or transactions made over our infrastructure to the IP address or origin making the RPC request. After processing IP addresses, we discard the IP address value within 24 hours. Read more here: https://blog.onfinality.io/how-does-onfinality-deal-with-personal-information/"}],"faucets":["https://faucet.fantom.network"],"nativeCurrency":{"name":"Fantom","symbol":"FTM","decimals":18},"infoURL":"https://docs.fantom.foundation/quick-start/short-guide#fantom-testnet","shortName":"tftm","chainId":4002,"networkId":4002,"slip44":1,"icon":"fantom","explorers":[{"name":"ftmscan","url":"https://testnet.ftmscan.com","icon":"ftmscan","standard":"EIP3091"}]}},"__N_SSG":true}