{"pageProps":{"chain":{"name":"Astar","chain":"ASTR","rpc":[{"url":"https://evm.astar.network"},{"url":"https://rpc.astar.network:8545"},{"url":"https://astar.public.blastapi.io","tracking":"limited","trackingDetails":"All the information in our logs (log data) can only be accessed for the last 7 days at any certain time, and it is completely purged after 14 days. We do not store any user information for longer periods of time or with any other purposes than investigating potential errors and service failures. https://blastapi.io/privacy-policy"},{"url":"https://getblock.io/nodes/bsc","tracking":"none","trackingDetails":"We automatically collect certain information through cookies and similar technologies when you visit, use or navigate Website. This information does not reveal your specific identity (like your name or contact information) and does not allow to identify you. However, it may include device and usage information, such as your IP address, browser and device characteristics, its type and version, operating system, language preferences, referring URLs, device name, country, location, information about how and when you use our Website, information about your interaction in our emails, and other technical and statistical information. This information is primarily needed to maintain the security and operation of our Website, and for our internal analytics and reporting purposes.Specifically, as the RPC provider, we do not log and store your IP address, country, location and similar data. https://getblock.io/privacy-policy/"},{"url":"https://1rpc.io/astr","tracking":"none","trackingDetails":"With the exception of data that will be public on chain, all the other metadata / data should remain private to users and other parties should not be able to access or collect it. 1RPC uses many different techniques to prevent the unnecessary collection of user privacy, which prevents tracking from RPC providers. https://docs.1rpc.io/technology/zero-tracking"},{"url":"https://astar-mainnet.g.alchemy.com/v2/demo","tracking":"yes","trackingDetails":"We may collect certain information automatically when you use our Services, such as your Internet protocol (IP) address, user settings, MAC address, cookie identifiers, mobile carrier, mobile advertising and other unique identifiers, browser or device information, location information (including approximate location derived from IP address), and Internet service provider. https://www.alchemy.com/policies/privacy-policy"},{"url":"https://astar.api.onfinality.io/public","tracking":"limited","trackingDetails":"For the sole purpose of providing our service, we temporarily record IP addresses and origins to check against free limits, provide load balancing, prevent DOS attacks, and to determine where best to locate our nodes. We do not, and will never, correlate or link specific wallet addresses or transactions made over our infrastructure to the IP address or origin making the RPC request. After processing IP addresses, we discard the IP address value within 24 hours. Read more here: https://blog.onfinality.io/how-does-onfinality-deal-with-personal-information/"},{"url":"wss://astar.api.onfinality.io/public-ws","tracking":"limited","trackingDetails":"For the sole purpose of providing our service, we temporarily record IP addresses and origins to check against free limits, provide load balancing, prevent DOS attacks, and to determine where best to locate our nodes. We do not, and will never, correlate or link specific wallet addresses or transactions made over our infrastructure to the IP address or origin making the RPC request. After processing IP addresses, we discard the IP address value within 24 hours. Read more here: https://blog.onfinality.io/how-does-onfinality-deal-with-personal-information/"},{"url":"https://astar-rpc.dwellir.com","tracking":"limited","trackingDetails":"Except for the data that is publicly accessible on the blockchain, Dwellir does not collect or keep any user information (like location, IP address, etc.) transmitted via our RPC. For more information about our privacy methods, we suggest checking out our Privacy Policy at https://www.dwellir.com/privacy-policy"},{"url":"wss://astar-rpc.dwellir.com","tracking":"limited","trackingDetails":"Except for the data that is publicly accessible on the blockchain, Dwellir does not collect or keep any user information (like location, IP address, etc.) transmitted via our RPC. For more information about our privacy methods, we suggest checking out our Privacy Policy at https://www.dwellir.com/privacy-policy"}],"faucets":[],"nativeCurrency":{"name":"Astar","symbol":"ASTR","decimals":18},"infoURL":"https://astar.network/","shortName":"astr","chainId":592,"networkId":592,"icon":"astar","explorers":[{"name":"subscan","url":"https://astar.subscan.io","standard":"none","icon":"subscan"},{"name":"blockscout","url":"https://blockscout.com/astar","icon":"blockscout","standard":"EIP3091"}],"tvl":95185525.55027215,"chainSlug":"astar"}},"__N_SSG":true}