{"pageProps":{"chain":{"name":"Klaytn Mainnet Cypress","chain":"KLAY","rpc":[{"url":"https://public-en-cypress.klaytn.net"},{"url":"https://klaytn-mainnet-rpc.allthatnode.com:8551","tracking":"yes","trackingDetails":"In addition to the Personal Information, the Billing Information, and the Geolocational Information..., we automatically collect certain information when you use the Platform or Website: IP addresses, browser type and language...; information about a mobile device, including universally unique ID (“UUID”), platform type and version (e.g., iOS or Android), carrier and country location, hardware and processor information, and network type; and activity and usage information occurring via the Platform or Website.https://www.allthatnode.com/privacypolicy.dsrv"},{"url":"https://rpc.ankr.com/klaytn ","tracking":"limited","trackingDetails":"For service delivery purposes, we temporarily record IP addresses to set usage limits and monitor for denial of service attacks against our infrastructure. Though we do look at high-level data around the success rate of transactions made over the blockchain RPC, we do not correlate wallet transactions made over the infrastructure to the IP address making the RPC request. Thus, we do not store, exploit, or share any information regarding Personal Identifiable Information (PII), including wallet addresses. https://www.ankr.com/blog/ankrs-ip-address-policy-and-your-privacy/"},{"url":"https://klaytn.blockpi.network/v1/rpc/public","tracking":"limited","trackingDetails":"We do not collect request data or request origin. We only temporarily record the request method names and IP addresses for 7 days to ensure our service functionality such as load balancing and DDoS protection. All the data is automatically deleted after 7 days and we do not store any user information for longer periods of time. https://blockpi.io/privacy-policy"},{"url":"https://klaytn.api.onfinality.io/public","tracking":"limited","trackingDetails":"For the sole purpose of providing our service, we temporarily record IP addresses and origins to check against free limits, provide load balancing, prevent DOS attacks, and to determine where best to locate our nodes. We do not, and will never, correlate or link specific wallet addresses or transactions made over our infrastructure to the IP address or origin making the RPC request. After processing IP addresses, we discard the IP address value within 24 hours. Read more here: https://blog.onfinality.io/how-does-onfinality-deal-with-personal-information/"},{"url":"https://1rpc.io/klay","tracking":"none","trackingDetails":"With the exception of data that will be public on chain, all the other metadata / data should remain private to users and other parties should not be able to access or collect it. 1RPC uses many different techniques to prevent the unnecessary collection of user privacy, which prevents tracking from RPC providers. https://docs.1rpc.io/technology/zero-tracking"},{"url":"https://klaytn-pokt.nodies.app","tracking":"none","trackingDetails":"What We Do Not Collect: User's IP address, request origin, request data. https://www.blog.pokt.network/rpc-logging-practices/"},{"url":"https://klaytn.drpc.org","tracking":"none","trackingDetails":"Specific types of technical data that we may temporarily log include:IP address (only in logs for redirecting requests to the nearest RPC nodes and rate limiting at the free level, which are cleared weekly). The user ID is hidden in the temporary logs, so it is not possible to link them to a specific user.https://drpc.org/privacy-policy"},{"url":"https://public-node-api.klaytnapi.com/v1/cypress"}],"faucets":[],"nativeCurrency":{"name":"KLAY","symbol":"KLAY","decimals":18},"infoURL":"https://www.klaytn.com/","shortName":"Cypress","chainId":8217,"networkId":8217,"slip44":8217,"explorers":[{"name":"Klaytnscope","url":"https://scope.klaytn.com","standard":"none"}],"tvl":144144833.8197463,"chainSlug":"klaytn"}},"__N_SSG":true}